[net]
# Training
batch=64
subdivisions=8
width=256
height=128
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

# Base LR for Adam/SGD in this repo.
learning_rate=0.0005
burn_in=1000
# Recommended long schedule for this dataset scale.
max_batches = 90000
policy=steps
# Two LR drops at 80% / 90% of max_batches.
steps=72000,81000
scales=.1,.1

# Small-object friendly training knobs
# Looser anchor-target matching to increase positive matches.
anchor_t=5.0
# Focal loss on objectness branch.
obj_focal_gamma=1.5
obj_focal_alpha=0.25
# Reweight box loss by inverse area^p (clamped by max_scale).
small_obj_power=0.35
small_obj_max_scale=3.0

# 0
[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

# 1: 256x128 -> 128x64
[aa_down]
filters=32
size=1
stride=2
activation=leaky

# 2
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# 3: 128x64 -> 64x32 (P2 backbone)
[aa_down]
filters=64
size=1
stride=2
activation=leaky

# 4
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

# 5 (P2 backbone)
[eca]
size=3

# 6: 64x32 -> 32x16 (P3 backbone)
[aa_down]
filters=128
size=1
stride=2
activation=leaky

# 7
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# 8 (P3 backbone)
[eca]
size=3

# 9: 32x16 -> 16x8 (P4 backbone)
[aa_down]
filters=256
size=1
stride=2
activation=leaky

# 10
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 11 (P4 backbone)
[eca]
size=3

# ---------- Top-down FPN ----------
# 12: P4 lateral
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 13
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

# 14
[upsample]
stride=2

# 15: concat with P3 backbone (layer 8)
[route]
layers = -1, 8

# 16
[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=1
activation=leaky

# 17 depthwise
[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
groups=96
activation=leaky

# 18: P3 top-down feature
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 19
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

# 20
[upsample]
stride=2

# 21: concat with P2 backbone (layer 5)
[route]
layers = -1, 5

# 22
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

# 23 depthwise
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
groups=64
activation=leaky

# 24: P2 top-down feature
[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=1
activation=leaky

# ---------- Lightweight PAN bottom-up ----------
# 25: P2 -> P3
[aa_down]
filters=96
size=1
stride=2
activation=leaky

# 26: concat with P3 top-down (layer 18)
[route]
layers = -1, 18

# 27
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 28 depthwise
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
groups=128
activation=leaky

# 29: P3 pan feature
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 30: P3 -> P4
[aa_down]
filters=128
size=1
stride=2
activation=leaky

# 31: concat with P4 lateral (layer 12)
[route]
layers = -1, 12

# 32
[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=leaky

# 33 depthwise
[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
groups=160
activation=leaky

# 34: P4 pan feature
[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=leaky

# ---------- P4 / stride16 detect ----------
# Largest anchors, lower-res head (semantic strong).
# 35 depthwise
[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
groups=160
activation=leaky

# 36 pointwise
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

# 37
[convolutional]
size=1
stride=1
pad=1
filters=54
activation=linear

# 38
[yolo]
mask = 6,7,8
anchors = 15, 13, 26, 10, 18, 16, 28, 14, 36, 13, 26, 20, 36, 19, 79, 11, 43, 33
classes=13
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0

# ---------- P3 / stride8 detect ----------
# Mid-size anchors and medium-res head.
[route]
layers = 29

# 39 depthwise
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
groups=128
activation=leaky

# 40 pointwise
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=leaky

# 41
[convolutional]
size=1
stride=1
pad=1
filters=54
activation=linear

# 42
[yolo]
mask = 3,4,5
anchors = 15, 13, 26, 10, 18, 16, 28, 14, 36, 13, 26, 20, 36, 19, 79, 11, 43, 33
classes=13
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0

# ---------- P2 / stride4 detect ----------
# Smallest anchors, high-res head for small objects.
[route]
layers = 24

# 43 depthwise
[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
groups=96
activation=leaky

# 44 pointwise
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 45
[convolutional]
size=1
stride=1
pad=1
filters=54
activation=linear

# 46
[yolo]
mask = 0,1,2
anchors = 15, 13, 26, 10, 18, 16, 28, 14, 36, 13, 26, 20, 36, 19, 79, 11, 43, 33
classes=13
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0
